tutorials/untested/testMappedBCV2/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     1.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}

reactionSourceEthyleneIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    field 		        ethylene;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("ethylene");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}

reactionSourceProdIW
{
    type            coded;
    active          yes;
    name	        reactionSourceCOIW;
    selectionMode   all;

    // field 		        CO;
    // field 		        ethylene;
    field 		        prod;

    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{        
        #include "../../constant/rnTerms/loadCommonData.H"      
        
        word currSpName("prod");
        
        #include "../../constant/rnTerms/r_powerLawV3.H"                 
    #};
}


enthalpySourceINWALL
{
    type            coded;	
    active          yes;
    name	        enthalpySourceINWALL;
    selectionMode   all;

    field 		        "T";
    
    codeInclude
    #{
        #include "fvCFD.H"
    #};

    codeAddRhoSup
    #{            
        #include "../../constant/rnTerms/loadCommonData.H"     
                    
        #include "../../constant/rnTerms/compEnthV2.H"                 
    #};
}